Revit 2026 API

# Transform2DPostScale Method

---

Scales both the linear and translational parts of this transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform2D PostScale(
	double scale
)
```
```vb
Public Function PostScale (
	scale As Double
) As Transform2D
```
```cpp
public:
Transform2D^ PostScale(
	double scale
)
```
```fsharp
member PostScale :
        scale : float -> Transform2D
```

#### Parameters

scale Double
     The scale value.

#### Return Value

Transform2D Returns a pointer to "this" Transform2D.

The resulting transformation is equivalent to the application of this transformation and then the uniform scale, in this order.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace